<?php

return [
    'accepted' => 'Поле :attribute необходимо принять.',
    'confirmed' => 'Подтверждение для поля :attribute не совпадает.',
    'email' => 'Укажите корректный адрес электронной почты.',
    'max' => [
        'numeric' => 'Значение поля :attribute не должно превышать :max.',
        'file' => 'Размер файла :attribute не должен превышать :max КБ.',
        'string' => 'Поле :attribute не должно содержать более :max символов.',
        'array' => 'Поле :attribute не должно содержать более :max элементов.',
    ],
    'min' => [
        'numeric' => 'Значение поля :attribute должно быть не меньше :min.',
        'file' => 'Размер файла :attribute должен быть не меньше :min КБ.',
        'string' => 'Поле :attribute должно содержать не менее :min символов.',
        'array' => 'Поле :attribute должно содержать не менее :min элементов.',
    ],
    'password' => [
        'letters' => 'Пароль должен содержать хотя бы одну букву.',
        'mixed' => 'Пароль должен содержать заглавные и строчные буквы.',
        'numbers' => 'Пароль должен содержать хотя бы одну цифру.',
        'symbols' => 'Пароль должен содержать хотя бы один специальный символ.',
        'uncompromised' => 'Этот пароль обнаружен в утечке данных. Выберите другой.',
    ],
    'required' => 'Поле :attribute обязательно для заполнения.',
    'unique' => 'Это значение поля :attribute уже используется.',
    'attributes' => [
        'email' => 'электронная почта',
        'name' => 'имя',
        'password' => 'пароль',
        'password_confirmation' => 'подтверждение пароля',
    ],
];
